---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailDisplayParametersOptions
source: html/a5354b93-7e81-67a7-4e60-b59d0b631461.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailDisplayParametersOptions

Describes how the parameters will be represented.

## Syntax (C#)
```csharp
public enum BendingDetailDisplayParametersOptions
```